Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: ཤཱ་རིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའི་ལྷའི་རྣ་བའི་ཁམས་རྣམ་པར་དག་པ་མིའི་ལས་ཤིན་ཏུ་འདས་པས་མི་དང་མི་མ་ཡིན་པ་གཉི་གའི་སྒྲ་ཡང་ཐོས་ཏེ། དེ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་དག་ན་གང་ལ་ལ་སྒྲར་གྲག་པ་ལྷའི་སྒྲའམ། ཀླུའི་སྒྲ་འམ། གནོད་སྦྱིན་གྱི་སྒྲ་འམ། དྲི་ཟའི་སྒྲ་འམ། ལྷ་མ་ཡིན་གྱི་སྒྲ་འམ། ནམ་མཁའ་ལྡིང་གི་སྒྲ་འམ། མིའམ་ཅིའི་སྒྲ་འམ། ལྟོ་འཕྱེ་ཆེན་པོའི་སྒྲ་འམ། མི་དང་མི་མ་ཡིན་པའི་སྒྲ་འམ། གང་ཡང་འཕགས་པའི་སྒྲ་འམ། སངས་རྒྱས་ཀྱི་སྒྲ་འམ། རང་སངས་རྒྱས་ཀྱི་སྒྲ་འམ། བྱང་ཆུབ་སེམས་དཔའི་སྒྲ་འམ། ཉན་ཐོས་ཀྱི་སྒྲ་ཡང་རུང་སྟེ དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའ་དེའི་ལྷའི་རྣ་བའི་ཁམས་ཀྱིས་རིག་གོ ། གང་ཡང་ངན་སོང་གི་སྒྲ་འམ། སེམས་ཅན་དམྱལ་བའི་སྒྲ་འམ། དུད་འགྲོའི་སྐྱེ་གནས་ཀྱི་སྒྲ་འམ། གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་སྒྲ་ཡང་རུང་སྟེ། དེ་དག་ཐམས་ཅད་དེའི་ལྷའི་རྣ་བའི་ཁམས་ཀྱིས་རིག་སྟེ། ཐ་ན་སྲིན་བུ་དང་། ཕྱེ་མ་ལེབ་དང་། སྦྲང་བུ་དང་། ཤ་སྦྲང་གི་སྒྲ་འམ། སེམས་ཅན་དེ་དག་གི་སེམས་ཀྱི་དམིགས་པ་དགེ་བའམ། མི་དགེ་བ་དེ་དག་གིས་ངག་གི་ལས་འབྱིན་པ་དེ་ཐམས་ཅད་ཀྱང་རབ་ཏུ་ཤེས་སོ། ། ངག་གི་ལས་གང་དགེ་བའི་རྒྱུ་འཛིན་པ་དང་། ངག་གི་ལས་གང་མི་དགེ་བའི་རྒྱུ་འཛིན་པ་དེ་ཡང་རབ་ཏུ་ཤེས་སོ། གང་འདོད་ཆགས་བག་ལ་ཉལ་ལས་ཁོང་ཁྲོ་བའི་ངག་གི་ལས་འབྱུང་བ་དང་། གང་ཞེ་སྡང་བག་ལ་ཉལ་ལས་ཆགས་པའི་ངག་གི་ལས་འབྱུང་བ་དང་། གང་འདོད་ཆགས་དང་ཞེ་སྡང་བག་ལ་ཉལ་ལས་རྨོངས་པའི་ངག་གི་ལས་འབྱུང་བ་དེ་ཡང་རབ་ཏུ་ཤེས་སོ། ། གང་གཏི་མུག་བག་ལ་ཉལ་ལས་ཆགས་པའི་ངག་གི་ལས་འབྱུང་བ་དང་། གང་འདོད་ཆགས་བག་ལ་ཉལ་ལས་ཆགས་པའི་ངག་གི་ལས་འབྱུང་བ་དང་། གང་ཞེ་སྡང་བག་ལ་ཉལ་ལས་ཞེ་སྡང་འབྱུང་བ་དང་། གཏི་མུག་བག་ལ་ཉལ་ལས་རྨོངས་པ་འབྱུང་བ་དེ་ཡང་རབ་ཏུ་ཤེས་སོ། ། ངག་གི་ལས་གང་། བསམ་པ་དག་ལ་སྦྱོར་བ་ཁོང་ཁྲོ་བ་དང་། ངག་གི་ལས་གང་སྦྱོར་བ་དག་ལ་བསམ་པ་ཁོང་ཁྲོ་བ་དེ་ཐམས་ཅད་ཀྱང་ལྷའི་རྣ་བའི་མངོན་པར་ཤེས་པ་དང་། ཡེ་ཤེས་ཐོགས་པ་མེད་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །
en: “Here, Śāriputra, the bodhisatva, by means of his perfectly pure, superhuman divine hearing, hears two kinds of sounds: sounds made by human beings and sounds made by nonhuman beings. Whatever sounds manifest in the unlimited, infinite worlds in the ten directions, whether they are the sounds of gods, the sounds of nāgas, the sounds of yakṣas, the sounds of gandharvas, the sounds of asuras, the sounds of garuḍas, the sounds of kinnaras, the sounds of mahoragas, the sounds of human beings, the sounds of nonhuman beings, the sounds of noble ones, the sounds of buddhas, the sounds of pratyekabuddhas, the sounds of bodhisatvas, or the sounds of śrāvakas, all these sounds come within the range of his divine hearing. The sounds of those who are in states of misfortune, that is to say the sounds of those in hell, the sounds of animals, or the sounds of those in the spirit world governed by Yama, even the sounds of worms, butterflies, flies, and mosquitoes, all come within the range of his divine hearing. He knows all the verbal actions that come forth from these beings on the basis of wholesome or unwholesome states of mind. He knows those verbal actions that take hold of the causes of wholesomeness. He knows those verbal actions filled with hostility that come forth on the basis of an inclination toward desire, those verbal actions filled with desire that come forth on the basis of an inclination toward hatred, those verbal actions filled with bewilderment that come forth on the basis of an inclination toward desire and hatred. He knows those verbal actions filled with attachment that come forth on the basis of an inclination toward confusion, those verbal actions filled with attachment that come forth on the basis of an inclination toward desire, those that are corrupted and come forth on the basis of an inclination toward hatred, and those that are filled with bewilderment and come forth on the basis of an inclination toward confusion. With his knowledge of this superior ability of uncorrupted divine hearing, he truly knows those verbal actions that come from a pure motivation but seem aggressive in practice, as well as those verbal actions that seem pure in practice but are based on an aggressive motivation.

source: དེ་ལྷའི་རྣ་བ་དེས་འཕགས་པ་རྣམས་དང་། འཕགས་པ་མ་ཡིན་པ་རྣམས་ཀྱི་སྒྲ་རྣམས་ཐོས་ཏེ། ཐོས་ནས་ཀྱང་འཕགས་པ་རྣམས་ཀྱི་སྒྲ་ལ་རྗེས་སུ་ཆགས་པ་ཡང་མེད། འཕགས་པ་མ་ཡིན་པ་རྣམས་ཀྱི་སྒྲ་ལ་ཁོང་ཁྲོ་བ་ཡང་མེད་དེ་འཕགས་པ་རྣམས་ཀྱི་སྒྲ་ལས་ནི་བྱམས་པ་ཆེན་པོ་རབ་ཏུ་རྙེད་དོ། ། འཕགས་པ་མ་ཡིན་པ་རྣམས་ཀྱི་སྒྲ་ལས་ནི་སྙིང་རྗེ་ཆེན་པོ་རབ་ཏུ་རྙེད་དོ། ། དེ་སྒྲ་དེ་ཐམས་ཅད་ཀྱིས་སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་ཡོངས་སུ་གཅོད་པའི་ཡེ་ཤེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། ། དེ་ལྷའི་རྣ་བ་དེས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་རབ་འབྱམ་མ་ལུས་པ་ཐམས་ཅད་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱིས་གསུངས་པ་ཐོས་ཏེ་ ཐོས་ནས་ ཀྱང་དྲན་པའི་སྣོད་མི་བརྗེད་པས་ཐམས་ཅད་ཀུན་ཏུ་འཛིན་ཏོ། ། ཀུན་ཏུ་བཟུང་ནས་ཀྱང་མི་རྗེད་པར་བྱེད་ཅིང་སེམས་ཅན་གྱི་སྣོད་ཇི་ལྟ་བ་བཞིན་དུ་སྟོན་པར་བྱེད་དོ། ། ཆོས་ཐམས་ཅད་རང་གི་ངང་གིས་འཇིག་པ་ཡང་རབ་ཏུ་ཤེས་སོ། ། དེ་བཞིན་གཤེགས་པ་གཅིག་གིས་ཆོས་བསྟན་པ་ཉན་ཀྱང་དེ་བཞིན་གཤེགས་པ་གཉིས་པས་ཆོས་བསྟན་པ་ལ་སྒྲིབ་པ་འམ། ཀུན་ནས་དཀྲིས་ཏེ་འདུག་པར་ཡང་མི་བྱེད་དེ།
en: “With this divine hearing, he hears the words of the noble ones and of those who are not noble ones. He does not become attached to the words of the noble ones and has no ill will toward the words of those who are not noble ones. The words of the noble ones bring forth great love in him, and the words of those who are not noble ones bring forth great compassion in him. He knows all words as they are, by means of the knowledge that distinguishes between the past and the present. With this divine hearing, he hears absolutely everything that is said by all the buddhas, all the lords in all the great multitude of world systems in the ten directions. So that he does not lose anything from the vessel of his memory, he retains everything he hears. He does not forget what he has retained but pours it into sentient beings as if they were vessels, and he knows that the particular flavor of all phenomena is transitoriness. He does not hear the Dharma teachings of one tathāgata and then use the Dharma teachings of another tathāgata to muddy them or contradict them.

source: ཡང་ཤཱ་རིའི་བུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱིས་གསུངས་པ་སྔ་ཕྱི་མེད་པར་ཀུན་ཏུ་འཛིན་ཏོ། ། གང་དགེ་བའི་རྩ་བའི་སྒྲ་ཐོས་པ་དེ་ཡང་དུས་དང་དུས་མ་ཡིན་པར་སྦྱོར་ཞིང་སྟོན་ཏོ། ། དེ་འཁོར་གྱི་དུས་ལ་བབ་བམ། སྐལ་བ་མི་མཉམ་པར་བསྟན་པའི་དུས་ཆོས་བསྟན་པའི་དུས་ལ་བབ་ཀྱང་འཇོག་སྟེ་ཐོས་ཀྱང་མི་སྟོན་ཏོ། ། ཆོས་ཀྱི་དུས་ལ་བབ་པའམ། འཁོར་གྱི་དུས་ལ་བབ་ན་གཅིག་སློབ་པ་ཡན་ཆད་ལ་ཡང་ཆོས་སྟོན་ཏེ། ལུང་བསྟན་པ་ཡང་དག་པའང་གཞན་ལ་གནོད་ན་མི་བྱེད་དོ། ། ལུང་བསྟན་པ་ཡང་དག་པ་མ་ཡིན་ཡང་དོན་དང་ལྡན་ན་གཞན་ལ་ཕན་གདགས་པ་དང་འཐུན་པར་ཐབས་ལ་མཁས་པས་རང་གི་སེམས་ཡོངས་སུ་དག་པའི་ཕྱིར་ལུང་སྟོན་ཏོ། སྒྲའི་རྣམ་པ་ཇི་ལྟ་བུ་ཐོས་པར་དགའ་བ་དེ་ལྟ་བུའི་སྒྲ་ཐོས་སོ། ། སྒྲའི་རྣམ་པ་ཇི་ལྟ་བུ་ལ་མི་དགའ་བ་དེ་ལྟ་བུའི་སྒྲའི་རྣམ་པ་མི་ཐོས་སོ། ། འཁོར་གང་ལ་ཆོས་སྟོན་པ་ན་བྱིན་གྱི་རླབས་ཀྱིས་སེམས་ཅན་རྣམས་ཀྱི་རྣ་བའི་རྣམ་པར་ཤེས་པས་སྒྲ་རབ་ཏུ་ཤེས་སོ། ། དེ་ལ་སེམས་ཅན་གང་དག་ཆོས་ཅང་ཤེས་པ་དེ་དག་གིས་ནི་དེའི་ཆོས་ཐོས་སོ། ། སེམས་ཅན་གང་དག་ཅང་ཤེས་མ་ཡིན་པ་དེ་དག་གིས་ནི་ཆོས་དེ་མི་ཐོས་སོ། ། དེའི་རྣ་བའི་ཁམས་དེ་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་རྣམ་པར་དག་པ་ཡིན། དེའི་རྣ་བའི་ཁམས་དེ་བདག་གི་ཁམས་ཀྱིས་རྣམ་པར་དག་པ་ཡིན། སེམས་ཅན་གྱི་ཁམས་ཀྱིས་རྣམ་པར་དག་པ་ཡིན་ནོ། ། དེའི་རྣ་བའི་ཁམས་དེ་སྒྲ་ཇི་ལྟ་བ་བཞིན་གྱི་ཡི་གེའི་ངེས་པའི་ཚིག་ཐོས་པས་ཤིན་ཏུ་རྟོགས་པ་ཡིན་ནོ། ། གང་འགྲོ་བ་ལྔར་སྐྱེས་པའི་སེམས་ཅན་དེ་དག་གི་སྐད་དང་སྨྲ་བ་སྣ་ཚོགས་ལ་འཇུག་པའི་ཕྱིར་ཆོས་སྟོན་ཏོ། ། དེའི་རྣ་བའི་ཁམས་དེ་ཡང་དེ་བཞིན་གཤེགས་པའི་ལྷའི་སྙན་དུ་ཡོངས་སུ་བསྔོས་པ་ཡིན་གྱི་ཐེག་པ་གཞན་དུ་ནི་མ་ཡིན་ཏེ། འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལྷའི་རྣ་བའི་མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་ཀྱི་ལས་ཡོངས་སུ་རྫོགས་པ་ཞེས་བྱའོ། །
en: Moreover, Śāriputra, he retains what is said by all the buddhas, the lords, which is without beginning and without end. He repeats those words he hears that are wholesome roots, because they lead to attainment both in times that are conducive to attainment and in times that are not. He absorbs Dharma teachings both in formal gatherings and even in situations not conducive to teaching but does not necessarily teach what he has heard. He teaches the Dharma in times that are conducive to the Dharma, and when there are assemblies to hear him, even if there is only one person who wants to hear it. He does not make a genuine prediction of awakening if it will bring harm to anyone. He makes a false prediction of awakening if it serves the purpose of bringing benefit and advantage to anyone, and he does so with a completely pure mind, as an application of skillful means. He hears the kinds of sounds that bring joy. He does not hear the kinds of sounds that do not bring joy. Where the Dharma is taught in assemblies of sentient beings, he knows that these sounds are a blessing to his ear consciousness, and the sentient beings there who are of the noble lineage of the Dharma hear his Dharma. Those sentient beings who are not of noble lineage do not hear him. His faculty of hearing is the complete purity of the totality of phenomena. His faculty of hearing is the complete purity of the element of the self. His faculty of hearing is the complete purity of the element of sentient beings. His faculty of hearing is fully perfected, because he hears utterances, syllables, and explanations as they are. In order to teach the Dharma to sentient beings who have been born into the five states of existence, he uses examples taken from their various kinds of speech and utterances. He transforms the divine hearing of a sentient being into the divine hearing of a tathāgata, not into that of any other vehicle. This is what is known as the practice of the superior ability and knowledge of divine hearing that the bodhisatva fully perfects.

source: ཤཱ་རིའི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཕ་རོལ་གྱི་སེམས་ཤེས་པ་མངོན་སུམ་དུ་བྱ་བ་སྐྱེས་པའི་མངོན་པར་ཤེས་པ་ནི་གང་། མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པ་ནི་གང་ཞེ་ན།
en: “What then, Śāriputra, is the superior ability and knowledge of the realization of the knowledge of the thoughts of others that bodhisatvas, great beings, possess? What is the practice of the superior ability and knowledge that they fully perfect?

source: ཤཱ་རིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་རབ་འབྱམ་མ་ལུས་པ་ཐམས་ཅད་ན། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་མཐའི་སེམས་ཀྱང་རབ་ཏུ་ཤེས། ཕྱི་མའི་མཐའི་སེམས་ཀྱང་རབ་ཏུ་ཤེས། ད་ལྟར་བྱུང་བའི་སེམས་ཀྱང་རབ་ཏུ་ཤེས་སོ། ། དེ་འདས་པའི་སེམས་ཤེས་པས། སེམས་ཅན་འདིའི་སེམས་ཀྱི་རྒྱུ་ནི་རྒྱུ་ཆེ་བའོ། ། སེམས་ཅན་འདིའི་སེམས་ཀྱི་རྒྱུ་ནི་རྒྱུ་འབྲིང་ངོ་། ། སེམས་ཅན་འདིའི་སེམས་ཀྱི་རྒྱུ་ནི་རྒྱུ་ཆུང་ངོ་། ། སེམས་ཅན་འདིའི་དབང་པོ་རྣམས་ནི་སྦྱིན་པ་དང་ལྡན་པའོ། ། སེམས་ཅན་འདིའི་དབང་པོ་རྣམས་ནི་ཚུལ་ཁྲིམས་དང་ལྡན་པའོ། ། སེམས་ཅན་འདིའི་དབང་པོ་རྣམས་ནི་བཟོད་པ་དང་ལྡན་པའོ། ། སེམས་ཅན་འདིའི་དབང་པོ་རྣམས་ནི་བརྩོན་འགྲུས་ཀྱི་བསམ་པ་དང་ལྡན་པའོ། ། སེམས་ཅན་འདིའི་དབང་པོ་རྣམས་ནི་བསམ་གཏན་གྱི་བསམ་པ་དང་ལྡན་པའོ། ། སེམས་ཅན་འདིའི་དབང་པོ་རྣམས་ནི་ཤེས་རབ་ཀྱི་བསམ་པ་དང་ལྡན་པའོ། ། སེམས་ཅན་འདིའི་དབང་པོ་རྣམས་ནི་བྱམས་པའི་རྣམ་པའོ། ། སེམས་ཅན་འདིའི་དབང་པོ་རྣམས་ནི་སྙིང་རྗེའི་རྣམ་པའོ། ། སེམས་ཅན་འདིའི་དབང་པོ་རྣམས་ནི་དགའ་བའི་རྣམ་པའོ། ། སེམས་ཅན་འདིའི་དབང་པོ་རྣམས་ནི་བཏང་སྙོམས་ཀྱི་རྣམ་པའོ། ། སེམས་ཅན་འདིའི་དབང་པོ་རྣམས་ནི་ཐེག་པ་ཆེན་པོའི་རྣམ་པའོ། ། སེམས་ཅན་འདིའི་དབང་པོ་རྣམས་ནི་རང་སངས་རྒྱས་ཀྱི་ཐེག་པའི་རྣམ་པའོ། ། སེམས་ཅན་འདིའི་དབང་པོ་རྣམས་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པའི་རྣམ་པའོ། ། སེམས་ཅན་འདི་ནི་རྒྱུའི་སྟོབས་ཅན་ཏེ་རྒྱུའི་གཙོ་བོའི་དགེ་བ་དང་ལྡན་པའོ། ། སེམས་ཅན་འདི་ནི་རྐྱེན་གྱི་སྟོབས་ཅན་ཏེ། རྐྱེན་གྱི་གཙོ་བོའི་རྒྱུ་དང་ལྡན་པའོ། ། སེམས་ཅན་འདི་ནི་རྒྱུའི་སྟོབས་ཅན་ཡིན་ཡང་། གཙོ་བོའི་དགེ་བ་དང་ལྡན་པ་མ་ཡིན་ཏེ། སེམས་ཅན་འདི་ནི་སྦྱོར་བའི་རྒྱུས་རིགས་དམའ་བར་སྐྱེས་པའོ། ། སེམས་ཅན་འདི་ནི་སྦྱོར་བའི་སྟོབས་ཅན་ཡིན་ཡང་དགེ་བ་རྒྱ་ཆེན་པོའི་རྒྱུ་དང་མི་ལྡན་ཏེ། སེམས་ཅན་འདི་ནི་རྒྱུའི་སྟོབས་བསྐྱེད་པའི་རྒྱུས་རིགས་ཆེན་པོར་སྐྱེས་པའོ། ། སེམས་ཅན་འདི་ནི་བསམ་པ་དག་ལ་སྦྱོར་བ་མ་དག་པའོ། ། སེམས་ཅན་འདི་ནི་སྦྱོར་བ་དག་ལ་བསམ་པ་མ་དག་པའོ། ། སེམས་ཅན་འདི་ནི་སྦྱོར་བ་ཡང་དག་ལ་བསམ་པ་ཡང་དག་པའོ། ། སེམས་ཅན་འདི་ནི་བསམ་པ་ཡང་མ་དག་ལ་སྦྱོར་བ་ཡང་མ་དག་པའོ། ། ཞེས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་རྒྱུ་དང་ཉེ་བའི་རྒྱུའི་རྣམ་གྲངས་ཀྱི་སེམས་ཤེས་པ་ལ་འཇུག་གོ །
en: “Here, Śāriputra, the bodhisatva knows the past thoughts of all sentient beings in absolutely all the great multitude of worlds in the ten directions. He knows their future thoughts. He knows their present thoughts. By means of his knowledge of the past thoughts of all sentient beings, he arrives at the knowledge of their mental circumstances of causes and secondary causes: ‘The causes of the thoughts of this sentient being are superior. The causes of the thoughts of this sentient being are average. The causes of the thoughts of this sentient being are inferior. The faculties of this sentient being are conducive to generosity. The faculties of this sentient being are conducive to morality. The faculties of this sentient being are conducive to patient acceptance. The faculties of this sentient being are conducive to vigor. The faculties of this sentient being are conducive to meditation. The faculties of this sentient being are conducive to wisdom. The faculties of this sentient being are oriented toward love. The faculties of this sentient being are oriented toward compassion. The faculties of this sentient being are oriented toward empathetic joy. The faculties of this sentient being are oriented toward equanimity. The faculties of this sentient being are oriented toward the Mahāyāna. The faculties of this sentient being are oriented toward the Pratyekabuddhayāna. The faculties of this sentient being are oriented toward the Śrāvakayāna. This sentient being is strong in their causes, and they possess the principal cause for that which is wholesome. This sentient being has strong circumstances and possesses the principal circumstantial causes. This sentient being, though, is strong in their causes but does not possess the principal cause for that which is wholesome. Caused by the way they engage, this sentient being is then reborn in an inferior family. This sentient being, again, might be able to practice, but they do not possess the causes of excellent wholesomeness. This sentient being, again, is reborn in a superior family because of the full causal power for that to happen has come about. This sentient being’s resolve is pure, but their practice is not pure. This sentient being’s practice is pure, but their resolve is not pure. This sentient being’s practice is pure, and their resolve is pure. This sentient being’s practice is not pure, and their resolve is not pure.’

source: ཤཱ་རིའི་བུ་དེ་ལྟར་གང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་འདས་པའི་རྒྱུའི་དབང་པོ་ལ་སེམས་ཀྱི་སྤྱོད་པ་ཤེས་པ་དང་། དེ་དག་ལ་ཅི་རིགས་པར་ཆོས་སྟོན་པ་ཤེས་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཕ་རོལ་གྱི་སེམས་ཤེས་པ་ཞེས་བྱའོ། ། ཡང་སེམས་ཅན་འདི་ད་ལྟར་སྦྱིན་པའི་རྒྱུ་སྟེ། མ་འོངས་པའི་དུས་ན་ཚུལ་ཁྲིམས་ཀྱི་རྒྱུར་འགྱུར་རོ། ། སེམས་ཅན་འདི་ད་ལྟར་ཚུལ་ཁྲིམས་ཀྱི་རྒྱུ་སྟེ། མ་འོངས་པའི་དུས་ན་སྦྱིན་པའི་རྒྱུར་འགྱུར་རོ། ། སེམས་ཅན་འདི་ད་ལྟར་བཟོད་པའི་རྒྱུ་སྟེ། མ་འོངས་པའི་དུས་ན་བརྩོན་འགྲུས་ཀྱི་རྒྱུར་འགྱུར་རོ། ། སེམས་ཅན་འདི་ད་ལྟར་བརྩོན་འགྲུས་ཀྱི་རྒྱུ་སྟེ། མ་འོངས་པའི་དུས་ན་བཟོད་པའི་རྒྱུར་འགྱུར་རོ། ། སེམས་ཅན་འདི་ད་ལྟར་འཇིག་རྟེན་པའི་སྤྱོད་པ་ཡིན་ལ་མ་འོངས་པའི་དུས་ན་རང་སངས་རྒྱས་ཀྱི་ཐེག་པའི་རྒྱུར་འགྱུར་རོ། ། སེམས་ཅན་འདིའི་དབང་པོ་རྣམས་ནི་ད་ལྟར་ཉན་ཐོས་ཀྱི་ཐེག་པའི་རྒྱུ་ལས་སྐྱེས་པ་སྟེ། མ་འོངས་པ་ན་ཐེག་པ་ཆེན་པོའི་རྒྱུ་ལས་སྐྱེས་པའི་དབང་པོ་རྣམས་སུ་འགྱུར་རོ། ། སེམས་ཅན་འདིའི་དབང་པོ་རྣམས་ནི་ད་ལྟར་ཉན་ཐོས་ཀྱི་ཐེག་པའི་རྒྱུ་ལས་སྐྱེས་པ་སྟེ། མ་འོངས་པའི་དུས་ན་རང་སངས་རྒྱས་ཀྱི་ཐེག་པའི་རྒྱུ་ལས་སྐྱེས་པའི་དབང་པོ་རྣམས་སུ་འགྱུར་རོ། ། སེམས་ཅན་འདིའི་དབང་པོ་རྣམས་ནི་ད་ལྟར་ཐེག་པ་ཆེན་པོའི་རྒྱུ་ལས་སྐྱེས་པ་སྟེ། མ་འོངས་པའི་དུས་ན་ཉན་ཐོས་ཀྱི་ཐེག་པའི་རྒྱུ་ལས་སྐྱེས་པར་འགྱུར་རོ། ། ཞེས་ཕྱི་མའི་མཐའི་སེམས་ལ་འཇུག་པ་ཤེས་སོ། ། ཤཱ་རིའི་བུ་དེ་ལྟར་མ་འོངས་པའི་དུས་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་རྣམས་ཀྱི་རྒྱུ་ལས་སྐྱེས་པ་གང་དང་རྣམ་པ་གང་དང་། རྐྱེན་དུ་འགྱུར་བ་གང་ཡིན་པ་དེའི་རྒྱུ་ལས་སྐྱེས་པ་དང་། དེའི་རྣམ་པ་དང་དེའི་རྐྱེན་རྣམས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། ། དེ་སེམས་ཅན་ཡོངས་སུ་མ་སྨིན་པ་ཐམས་ཅད་ལ་དེའི་སེམས་ལ་འཇུག་པའི་ཤེས་པའི་བར་དུ་སྐྱོ་བར་མི་བྱེད་དེ། དེའི་ཆོས་ཀྱི་སྣོད་ཅི་འདྲ་བར་ཆོས་སྟོན་ཏོ། ། དེ་འབྲས་བུ་ཡོད་པའི་ཆོས་སྟོན་ཀྱང་ཆོས་ཀྱི་ལས་བྱས་སོ་ཞེས་བྱེད་པ་མ་ཡིན་ནོ། ། གང་ད་ལྟར་བྱུང་བའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་སེམས་ལས་བྱུང་བའི་ཆོས་རྣམས་འཇུག་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ། འདོད་ཆགས་དང་བཅས་པའི་སེམས་ཀྱང་འདོད་ཆགས་དང་བཅས་པའི་སེམས་སུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། ། འདོད་ཆགས་དང་བྲལ་བའི་སེམས་ཀྱང་འདོད་ཆགས་དང་བྲལ་བའི་སེམས་སུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་ཏུ་རབ་ཏུ་ཤེས་སོ། །ཞེ་སྡང་དང་བཅས་པའི་སེམས་ཀྱང་ཞེ་སྡང་དང་བཅས་པའི་སེམས་སུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། ། ཞེ་སྡང་མེད་པའི་སེམས་ཀྱང་ཞེ་སྡང་མེད་པའི་སེམས་སུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། ། གཏི་མུག་དང་བཅས་པའི་སེམས་ཀྱང་གཏི་མུག་དང་བཅས་པའི་སེམས་སུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། ། གཏི་མུག་མེད་པའི་སེམས་ཀྱང་གཏི་མུག་མེད་པའི་སེམས་སུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། ། ཤཱ་རིའི་བུ་དེ་ལྟར་ཀུན་ནས་ཉོན་མོངས་པ་གང་དང་གང་གིས་སེམས་ཅན་གང་དང་གང་གི་སེམས་བསྒྲིབས་པ་དེ་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ། ཤེས་ནས་ཀྱང་ཉོན་མོངས་པ་ལས་གདོན་པའི་ཕྱིར་དེ་ལྟ་དེ་ལྟ་བུར་ཆོས་སྟོན་ཏེ། འཁོར་གང་གི་ནང་དུ་འགྲོ་ཡང་ཐོག་མ་ཉིད་དུ་འཁོར་དེ་དག་ཐམས་ཅད་ལ་རྣམ་པར་ལྟའོ། ། རྣམ་པར་བལྟས་ནས་སེམས་ཅན་རྣམས་ལ་ཇི་ལྟ་ཇི་ལྟ་བུར་རིགས་པ་དེ་ལྟ་དེ་ལྟ་བུའི་ཆོས་སྟོན་ཏེ། ཤཱ་རིའི་བུ་དེ་ལྟར་གང་སེམས་ཅན་དེ་དག་གི་དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པར་ཤེས་པ་དེ་ཐམས་ཅད་རབ་ཏུ་ཤེས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་རང་གི་སེམས་ལྷུར་བྱེད་པའང་མ་ཡིན་ལ་གཞན་གྱི་སེམས་ལྷུར་བྱེད་པ་ཡང་མ་ཡིན་ནོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: In this way, Śāriputra, he knows the mental activity of all sentient beings, which takes place within their faculties and is created by previous causes. He thereby understands how to teach them the Dharma in an appropriate way. This is what is known as the bodhisatva’s knowledge of the thoughts of others. “Moreover, he knows what their mentality will eventually lead to: ‘That which will be this sentient being’s cause for morality in the future is his present cause for generosity. That which will be this sentient being’s cause for generosity in the future is his present cause for morality. That which will be this sentient being’s cause for vigor in the future is his present cause for patient acceptance. That which will be this sentient being’s cause for patient acceptance in the future is his present cause for vigor. That which will be this sentient being’s cause for wisdom in the future is his present cause for worldly conduct. What will be this sentient being’s aptitude for the Mahāyāna in the future is his present aptitude for the Śrāvakayāna. What will be this sentient being’s aptitude for the Pratyekabuddhayāna in the future is his present aptitude for the Śrāvakayāna. What will be this sentient being’s aptitude for the Śrāvakayāna in the future is his present aptitude for the Mahāyāna.’ In this way, Śāriputra, he truly knows those causes, those forms, and those conditions that will be the faculties of all sentient beings in times to come. He does not grow weary of bringing sentient beings to maturity but knows how to assess their minds. He then sees what sort of Dharma vessel they are and teaches them accordingly. He teaches the Dharma in a way that is useful to them and does not do it just as a ‘Dharma duty.’ He truly knows the mental phenomena of all sentient beings as they are, whether they occur in the present or in the future. He knows that a mind filled with desire is a mind filled with desire. He truly knows that a mind free from desire is a mind free from desire. He truly knows that a mind filled with hatred is a mind filled with hatred. He truly knows that a mind free from hatred is a mind free from hatred. He truly knows that a mind filled with delusion is a mind filled with delusion. He truly knows that a mind free from delusion is a mind free from delusion. In this way, Śāriputra, he knows what corruptions any particular sentient being is filled with, and because he knows this, he is able to teach them the Dharma in such a way as to rid them of their vices. When he approaches an assembly, he first examines the assembly carefully. When he has examined it carefully, he teaches the Dharma to those sentient beings in whatever way is most suitable for them. In this way, Śāriputra, he knows the faculties, superior and inferior, of all those sentient beings. The bodhisatva, though, does not give priority to his own thoughts, nor does he give priority to the thoughts of others. Why is this?

source: དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དེའི་སེམས་ཀྱི་རྒྱུན་ནི་ཡེ་ཤེས་ཀྱིས་རིག་པའོ། ། སེམས་ཀྱི་རྒྱུན་ནི་དྲན་པས་རིག་པའོ། ། བློ་གྲོས་ཀྱིས་རིག་པའོ། ། སེམས་ཀྱི་རྒྱུན་ནི་རྟོགས་པས་རིག་པའོ། ། སེམས་ཀྱི་རྒྱུན་ནི་ཤེས་རབ་ཀྱིས་རིག་པའོ། ། སེམས་ཀྱི་རྒྱུན་ནི་བློས་རིག་པའོ། ། སེམས་ཀྱི་རྒྱུན་ནི་ཉོན་མོངས་པ་མེད་པ། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཡང་དག་པར་བཅད་པ། དག་པ། དྲི་མ་མེད་པ། འོད་གསལ་བ། ཁ་ན་མ་ཐོ་བ་མེད་པ། མི་རྩུབ་པ། རྙོག་པ་མེད་པ། ཆོས་ཐམས་ཅད་སྣང་བར་རིག་པའོ། ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་སྤྱོད་པའི་རྗེས་སུ་ཞུགས་པར་རིག་པའོ། །
en: It is because the bodhisatva knows that his stream of thoughts possesses knowledge. He knows that his stream of thoughts possesses mindfulness. He knows that his stream of thoughts possesses resolve. He knows that his stream of thoughts possesses wisdom. He knows that his stream of thoughts possesses intelligence. He knows that his stream of thoughts is free from the vices and that any connection to habitual tendencies has been completely uprooted. He knows that it is pure, stainless, clear, flawless, supple, and spotless. He knows the manifestations of all phenomena. He knows that his stream of thoughts has penetrated the mental activity of all sentient beings. In this way, Śāriputra, he penetrates the knowledge of thoughts among the various kinds of phenomena. This is what is known as the practice of the superior ability and knowledge of knowing the thoughts of others, which the bodhisatva fully perfects.

source: ཤཱ་རིའི་བུ་དེ་ལྟར་གང་འདི་ལྟ་བུའི་ཆོས་ལ་སེམས་ཤེས་པ་འཇུག་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཕ་རོལ་གྱི་སེམས་མངོན་པར་ཤེས་པ་དང་། ཡེ་ཤེས་ཀྱི་ལས་ཡོངས་སུ་རྫོགས་པ་ཞེས་བྱའོ། ། ཤཱ་རིའི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་མངོན་སུམ་དུ་བྱ་བའི་མངོན་པར་ཤེས་པ་ནི་གང་། མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་ཀྱི་ལས་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ནི་གང་ཞེ་ན།
en: “What then, Śāriputra, is the superior ability of directly realized recollection of previous states of existence, which the bodhisatva possesses? What is the practice of the superior ability and knowledge that he fully perfects?

source: ཤཱ་རིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་རབ་འབྱམ་མ་ལུས་པ་ཐམས་ཅད་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྐྱེ་བ་གཅིག་དང་། གཉིས་དང་། གསུམ་དང་། བཞི་དང་། ལྔ་དང་། བཅུ་དང་། ཉི་ཤུ་དང་། སུམ་ཅུ་དང་། བཞི་བཅུ་དང་ལྔ་བཅུ་དང་། སྐྱེ་བ་བརྒྱ་དང་། སྐྱེ་བ་སྟོང་དང་། སྐྱེ་བ་བརྒྱ་ཕྲག་སྟོང་དང་། སྐྱེ་བ་བརྒྱ་ཕྲག་དུ་མ་དང་། སྐྱེ་བ་སྟོང་ཕྲག་དུ་མ་དང་། སྐྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། འཇིག་པའི་བསྐལ་པ་དང་། འཆགས་པའི་བསྐལ་པ་དང་། འཇིག་པ་དང་། འཆགས་པའི་བསྐལ་པ་དང་། འཇིག་པའི་བསྐལ་པ་དུ་མ་དང་། འཆགས་པའི་བསྐལ་པ་དུ་མ་དང་། འཇིག་པ་དང་། འཆགས་པའི་བསྐལ་པ་དུ་མ་དང་།
en: “Here, Śāriputra, the bodhisatva recollects the many different previous existences of all sentient beings in the unlimited worlds in the ten directions. He can recollect one past lifetime, two, three, five, twenty, thirty, forty, fifty, or a hundred lifetimes, a thousand lifetimes, many hundreds of lifetimes, many thousands of lifetimes, and many hundreds of thousands of lifetimes. He can remember as far back as an eon of destruction, an eon of evolution, and eon of destruction and evolution, a multitude of eons of destruction, a multitude of eons of evolution, and a multitude of eons of destruction and evolution, and he can state with precision,
